---
kind: property
id: P:Autodesk.Revit.DB.CurveElement.SupportsTangentLocks
source: html/b0fded94-12f7-963f-5e1b-7a67d8bc7ba3.htm
---
# Autodesk.Revit.DB.CurveElement.SupportsTangentLocks Property

Indicates whether or not this curve element can have a locked tangent
 join at either of its end-points shared with another curve element.

## Syntax (C#)
```csharp
public bool SupportsTangentLocks { get; }
```